# Taps
tap "azure/functions"
tap "hashicorp/tap"
tap "heroku/brew"
tap "johanhaleby/kubetail"
tap "homebrew/cask-drivers"

# Utils
brew "actionlint"
brew "adr-tools"
brew "asciinema"
brew "asdf"
brew "azcopy"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "aws-iam-authenticator"
brew "aws-vault"
brew "black"
brew "cmake"
brew "cloudfoundry/tap/cf-cli@7"
brew "coreutils"
brew "curl"
brew "drawio"
brew "exercism"
brew "fd"
brew "gawk"
brew "gcc"
brew "glow"
brew "gpg"
brew "gpg-suite-no-mail"
brew "gnu-sed"
brew "hashicorp/tap/terraform"
brew "hugo"
brew "imagemagick"
brew "jmeter"
brew "jq"
brew "jupyterlab"
brew "llvm"
brew "luarocks"
brew "mkcert"
brew "ninja"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "shellcheck"
brew "tfenv"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "yq"

# Terminal
brew "bash"
brew "btop"
brew "cmatrix"
brew "fzf"
brew "htop"
brew "ripgrep"
brew "tldr"
brew "tmux"

# Git
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "lazygit"

# Editors
brew "neovim"
brew "vim"

# Languages
brew "elixir"
brew "erlang"
brew "go"
brew "groovy"
brew "haskell-stack"
brew "java"
brew "node"
brew "ruby"
brew "scala"

# Containers/K8s
brew "derailed/k9s/k9s"
brew "flyctl"
brew "helm"
brew "heroku"
brew "kind"
brew "kubernetes-cli"
brew "kubetail"
brew "lazydocker"
brew "linkerd"
brew "minikube"
brew "rancher-cli"
brew "skaffold"
brew "stern"

# Databases
brew "beekeeper-studio"
brew "pgadmin4"
brew "postgresql@16"
brew "redis"
brew "sqlite"

# Casks - Browsers
cask "finicky"
cask "firefox"
cask "google-chrome"

# Casks - Utils
cask "alacritty"
cask "another-redis-desktop-manager"
cask "caffeine"
cask "db-browser-for-sqlite"
cask "dotnet-sdk"
cask "gimp"
cask "google-drive"
cask "google-cloud-sdk"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "lens"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "ngrok"
cask "owasp-zap"
cask "postman"
cask "powershell"
cask "rectangle"
cask "royal-tsx"
cask "wireshark"
cask "xcodes"

# Casks - Editors
cask "visual-studio-code"

# Casks - Communication
cask "microsoft-teams"
cask "signal"
cask "slack"
